จำนวนสระ
จงเขียนโปรแกรมโดยใช1ลูป for โดยให1รับค9าจำนวนเต็ม 1 จำนวนจากแป@นพิมพC (N) จากนั้น
ให1วน loop รับค9าตัวอักษรตัวพิมพCใหญ9อีกทั้งหมด n ตัว แล1วให1หานับว9ามีสระอยู9กี่ตัว (สระ คือ A, E,
I, O U)
ข"อมูลเข"า: บรรทัดแรกเป]นตัวเลขจำนวนเต็มบวกที่บอกจำนวนของการวนรับตัวอักษรภาษาอังกฤษพิมพEใหญS n ตัว
และ N บรรทัดถัดมา คือ ตัวอักษรภาษาอังกฤษพิมพEใหญS 1 ตัว ตSอ 1 บรรทัดตามจำนวน n บรรทัดที่กำหนดไว"
ผลลัพธE: จำนวนสระที่นับได"จากข"อมูลที่รับเข"ามา
ตัวอยSาง:
ข1อมูลเข1า ผลลัพธC
3
C
A
R
1
ข1อมูลเข1า ผลลัพธC
4
B
O
A
T
2